src/cfe/Documents/Корреспонденция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Корреспонденция</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корреспонденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СпособОтправки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/Catalogs/ДокументыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДокументыПредприятия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утвердил</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дело</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВременныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестоРассмотрения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоРассмотренияПоДокументуЗВДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Тематика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РешениеЦО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РешенияПоДокументамЗВДС_ЦО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗаявления_ТТС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтанцияПринявшаяЗаявление_ТТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции_ТТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоИсполненияОбязательств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагенты</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стороны</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/РаботаСКорреспонденцией/Ext/Module.bsl
&ИзменениеИКонтроль("ПроверкаЗаполненияФормыНаСервере")
Процедура ЦППК_ПроверкаЗаполненияФормыНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	ВидДокументаКэш = Форма.ВидДокументаКэш;
	ОбъектОснование = Форма.Объект;
	Объект = Форма.Объект;
	Если ВидДокументаКэш.ЯвляетсяОбращениемОтГраждан Тогда 
		ПроверяемыеРеквизиты.Добавить("ВидОбращения");
		
		Если ЗначениеЗаполнено(Форма.ПервичноеОбращение) 
			И Форма.ПервичноеОбращение = Объект.Ссылка Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Указана ссылка на самого себя'"),,"ПервичноеОбращение",,Отказ);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Форма.ОсновноеОбращение) 
			И Форма.ОсновноеОбращение = Объект.Ссылка Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Указана ссылка на самого себя'"),,"ОсновноеОбращение",,Отказ);
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("РегламентированныйУчетОбращений") Тогда
			Если Форма.ВопросыОбращения.Количество() = 0 Тогда 
				ДатаПроверкиНаличияВопросов = ДелопроизводствоСерверПовтИсп.ДатаПроверкиНаличияВопросов();
				
				Если Не ЗначениеЗаполнено(ДатаПроверкиНаличияВопросов)
					Или (ЗначениеЗаполнено(ДатаПроверкиНаличияВопросов) 
						И ЗначениеЗаполнено(Объект.ДатаРегистрации) И Объект.ДатаРегистрации > ДатаПроверкиНаличияВопросов)
					Или (ЗначениеЗаполнено(ДатаПроверкиНаличияВопросов) 
						И Не ЗначениеЗаполнено(Объект.ДатаРегистрации) И Объект.ДатаСоздания > ДатаПроверкиНаличияВопросов) Тогда 
					ОбщегоНазначения.СообщитьПользователю(
						НСтр("ru = 'Не указано ни одного вопроса документа'"),,
							"КодВопроса",, Отказ);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			//Проверка табличной части ВопросыОбращения на задвоения
			КоличествоВопросыОбращения = Форма.ВопросыОбращения.Количество();
			Если КоличествоВопросыОбращения > 1 Тогда
				Для Инд1 = 0 По КоличествоВопросыОбращения - 2 Цикл
					Для Инд2 = Инд1 + 1 По КоличествоВопросыОбращения - 1 Цикл
						Если Форма.ВопросыОбращения[Инд1].Вопрос = Форма.ВопросыОбращения[Инд2].Вопрос Тогда 
							ТекстСообщения = СтрШаблон(
								НСтр("ru = 'Вопрос ""%1"" указан дважды в списке вопросов обращения'"),
								Форма.ВопросыОбращения[Инд2].КодВопроса);
							
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,
								"ВопросыОбращения["+ Формат(Инд2, "ЧН=0; ЧГ=0") +"].КодВопроса",,Отказ);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ВидДокументаКэш.ЯвляетсяВходящейКорреспонденцией Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ИсходящаяДата) 
		Или Не ЗначениеЗаполнено(Форма.ИсходящийНомер)
		Или НРег(Форма.ИсходящийНомер) = НСтр("ru = 'б\н'") 
		Или НРег(Форма.ИсходящийНомер) = НСтр("ru = 'б/н'") Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
#Удаление
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Корреспонденция.Ссылка КАК Ссылка,
	|	ДокументОснование.РегистрационныйНомер КАК РегистрационныйНомер
	|ИЗ
	|	Документ.Корреспонденция КАК Корреспонденция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыПредприятия КАК ДокументОснование
	|		ПО (ДокументОснование.Ссылка = Корреспонденция.Основание)
	|ГДЕ
	|	ДокументОснование.Ссылка <> &Ссылка
	|	И Корреспонденция.НомерКонтрагента = &НомерКонтрагента
	|	И Корреспонденция.ДатаКонтрагента = &ДатаКонтрагента
	|	И Корреспонденция.Корреспонденты.Корреспондент = &Контрагент
	|	И ДокументОснование.ВидДокумента = &ВидДокумента
	|	И НЕ Корреспонденция.ПометкаУдаления";
#КонецУдаления
#Вставка
	"ВЫБРАТЬ
	|	Корреспонденция.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКорреспонденция
	|ИЗ
	|	Документ.Корреспонденция.Корреспонденты КАК КорреспонденцияКорреспонденты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Корреспонденция КАК Корреспонденция
	|		ПО (КорреспонденцияКорреспонденты.Корреспондент = &Контрагент)
	|			И КорреспонденцияКорреспонденты.Ссылка = Корреспонденция.Ссылка
	|ГДЕ
	|	Корреспонденция.НомерКонтрагента = &НомерКонтрагента
	|	И Корреспонденция.ДатаКонтрагента = &ДатаКонтрагента
	|	И НЕ Корреспонденция.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументОснование.Ссылка КАК Ссылка,
	|	ДокументОснование.РегистрационныйНомер КАК РегистрационныйНомер
	|ИЗ
	|	втКорреспонденция КАК втКорреспонденция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыПредприятия КАК ДокументОснование
	|		ПО втКорреспонденция.Ссылка.Основание = ДокументОснование.Ссылка
	|ГДЕ
	|	ДокументОснование.ВидДокумента = &ВидДокумента
	|	И ДокументОснование.Ссылка <> &Ссылка";
#КонецВставки
	
	Запрос.УстановитьПараметр("НомерКонтрагента", СокрЛП(Форма.ИсходящийНомер));
	Запрос.УстановитьПараметр("ДатаКонтрагента", Форма.ИсходящаяДата);
	Запрос.УстановитьПараметр("Контрагент", ОбъектОснование.Контрагент);
	Запрос.УстановитьПараметр("Ссылка", ОбъектОснование.Ссылка);
	
	Запрос.УстановитьПараметр("ВидДокумента", ОбъектОснование.ВидДокумента);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда
#Удаление
		Запрос.Текст = Запрос.Текст + " И (Организация = &Организация) ";
#КонецУдаления
#Вставка
		Запрос.Текст = Запрос.Текст + " И (ДокументОснование.Организация = &Организация) ";
#КонецВставки
		Запрос.УстановитьПараметр("Организация", ОбъектОснование.Организация);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Если ДелопроизводствоКлиентСервер.ДокументЗарегистрирован(Выборка.РегистрационныйНомер) Тогда
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Документ №%1 от %2 уже зарегистрирован!'"),
				СокрЛП(Форма.ИсходящийНомер),
				Формат(Форма.ИсходящаяДата, "ДЛФ=D"));
		Иначе
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Документ №%1 от %2 уже записан!'"),
				СокрЛП(Форма.ИсходящийНомер),
				Формат(Форма.ИсходящаяДата, "ДЛФ=D"));
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,,
			"ИсходящийНомер",,
			Отказ);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
